{
  "ACPU": {
    "name": "マーズ",
    "archetype": "Warrior",
    "description": "This type combines strong intuition with explosive action, naturally embodying the philosophy of 'just try it first' and 'think while doing.' Rather than gathering information before making careful judgments, they believe 'you won't know until you try,' and tend to gain their footing through hands-on practice and real-world experience. They are honest with their impulses and inspirations, possessing the speed to start moving the moment an idea or sensation strikes. Their drive can become an energy that draws others in, serving as a catalyst that propels those around them forward. On the other hand, they can lack planning ability, often needing to make adjustments after acting on impulse. However, because they possess the flexibility and persistence to think while moving, they frequently end up becoming highly effective challengers.",
    "decision_making_style": "This type's decision-making is triggered by intuitive, sensory internal signals like 'this could work' or 'now is the time to act.' Rather than organizing or comparing information, sensory elements such as 'is there energy gathering here?' and 'is there meaning in moving now?' strongly influence their decisions, making them extremely fast at reaching conclusions. Rational justification often comes after the fact, as they tend to add meaning to actions retroactively. They have a strong ability to learn from experience, refining their judgment criteria through failure, making the act of moving itself a part of their decision-making process. When in doubt, their default is to 'move first,' possessing a judgment structure where action validates their intuition.",
    "choice_pattern": "When faced with options, this type is strongly drawn to 'whatever clicks the most' or 'whatever I can't stand not doing right now.' They prioritize impulse over planning, making decisions with the sense that 'if I don't move on this now, I'll miss the wave.' Rather than choosing carefully, they find their optimal solution by diving in first and thinking later. Because of this, they may struggle to explain their reasoning when asked afterward, but internally they carry a conviction that 'they simply couldn't help but choose it.' Their creed is 'move and verify' rather than compare and deliberate -- if there's an opportunity, they try it, and they can't make a final decision without firsthand experience.",
    "blindspot": "The risk for this type is 'moving too impulsively and ending up with weak planning.' By prioritizing intuition and energy, they may skip preparation and verification, frequently finding themselves scrambling to recover afterward. Additionally, because their passion runs high, their long-term sustainability can be uneven, and they may suddenly lose momentum when they feel 'I started this but got bored' or 'this wasn't what I expected.' Furthermore, when they become frustrated with others' slower pace, they tend toward unilateral action. While honoring their impulses, developing the ability to 'design sustainable structures for their momentum' allows their natural drive to be expressed more consistently.",
    "interpersonal_dynamics": "This type has excellent compatibility with **logic-oriented types who design overall structures (e.g., S1-DG)** and **flexible types who read the room and make adjustments (e.g., S2-TC)**. They can maintain their speed of initiative while gaining sustainability in action and stability in relationships. Additionally, with **emotionally resonant types who share their spontaneity (e.g., S3-PC)**, the resonance of impulse with impulse creates explosive power to move things forward rapidly. However, they tend to clash with overly cautious conservative types or those who are slow to start, often feeling irritation and impatience. The key to success lies in having partners who can accept their pace and 'move together while making adjustments along the way.'",
    "growth_path": "For this type to evolve, it is essential to develop the ability to 'convert impulse into structure.' By elevating their strength of being able to move on feeling into 'moving with intention and purpose,' they can achieve more sustained and influential action. In particular, cultivating the habit of carefully reflecting afterward on 'why was I drawn to that?' and 'what meaning did that choice carry?' transforms impulse into experiential wisdom. Additionally, learning action design principles like 'start small and gradually expand' equips them not just with the power to leap but also with the power to nurture. When both momentum and design begin working in tandem, this type achieves its most dynamic growth."
  },
  "ACBL": {
    "name": "ソーラー",
    "archetype": "Sun",
    "description": "This type combines intuitive sensing with a soft resonance sensitivity, possessing a sensory-thinking style that instantly perceives and absorbs changes in people and events around them. They delicately capture 'pre-verbal awareness' such as 'this seems likely to turn out this way' or 'that person might actually be thinking this,' interpreting the world through multiple perspectives. Unbound by any single logic or framework, they use the fluidity of their senses to bridge 'the space between now and what comes next.' Their style involves slowly nurturing the intuitions that arise within them, then verbalizing them after observing the dynamics of the environment and people's states -- preferring to deepen 'meaningful awareness' before acting rather than making improvised moves. Outwardly gentle yet inwardly strong, they build structural understanding of the world on a foundation of sensitivity and observation.",
    "decision_making_style": "This type's decision-making is based on sensory future prediction -- 'how will the current flow change?' and 'what does this choice mean?' They consider not just immediate gains and losses, but constantly explore 'what context does this decision exist within?' and 'where does it lead?' As a result, they may sometimes appear indecisive, but internally a great deal of information and intuition is intertwined, with highly complex filtering taking place. They are not easily swayed by others' opinions; they only move once 'meaning generation' has settled within them. While reading the atmosphere, they firm up their intent using indicators like 'fundamental discomfort' or 'possibility' that lie beneath the surface.",
    "choice_pattern": "In making choices, they are always conscious of 'possibilities not yet present' and 'developments just ahead,' rarely deciding based solely on the options in front of them. Rather than A or B, their thinking naturally turns to 'what lies between A and B?' or 'isn't there a C option?' -- enabling them to find choices others might overlook. After grasping a direction intuitively, they decide by sensorially simulating how it might develop and who it might affect. On the other hand, when their senses misfire or they feel a disconnect with their environment, they can suddenly become unstable, tending to repeatedly ask themselves 'is the current choice right?' They excel not so much in the power to choose as in the power to perceive.",
    "blindspot": "While this type excels at nuanced, multi-perspective judgment, they carry the risk of 'overthinking to the point of paralysis.' By reading too many possibilities and contexts, they can lose the ability to make simple decisions or exhaust themselves by doubting their own senses too much. In environments where quick decisions are expected, they may fall into self-denial, feeling that 'my judgment pace is too slow.' Furthermore, being overly sensitive to empathy can blur the boundary between their own judgment and others' intentions. The key is not 'choosing not to choose' but 'choosing in a way that satisfies oneself.' They need the perspective of trusting their complex judgment ability while designing environments where they can also act simply.",
    "interpersonal_dynamics": "This type has excellent compatibility with **types who complement through logic (e.g., S1-TC)** and **action-oriented types who provide catalysts for execution (e.g., S3-DG)**. Having someone who carefully receives 'what they understand but cannot put into words' and organizes it structurally increases both the speed and accuracy of their decision-making. They can also build relationships of deep sensory understanding with **resonance types (e.g., S2-TC)**. However, they tend to clash with managerial types who rush decisions or those with narrow, one-sided assertions, and they easily lose confidence in their judgment. Relationships where they can 'share their thinking and open up the world together' bring out this type's power to the fullest.",
    "growth_path": "For this type to evolve, the key is accumulating the experience of 'sharing what they see intuitively with others.' By putting their feelings and emerging sense of discomfort into words rather than swallowing them, their perceptions gain definition, and their structural precision improves. Additionally, when they can give themselves permission that 'it's okay to move based on what I know now, even if I don't understand everything,' the gap between judgment and action becomes easier to bridge. Furthermore, experiencing through dialogue that their perspective has 'meaning-generating power' opens their thinking outward, sharpening the intuition needed to shape the future. The key to evolution is transforming the power to read the future into the power to create it."
  },
  "ACCV": {
    "name": "フレア",
    "archetype": "Revolutionary",
    "description": "This type is an intuition-dominant, highly impulsive actor who 'feels before thinking' and 'moves as soon as they feel.' Their internal impulses are easily activated through resonance -- 'that person's words resonated with me' or 'the atmosphere of this place pushed me forward' -- and the switch flips at the 'moment they feel something.' Their actions may sometimes appear sudden, but internally they carry intense conviction and certainty, and their energy is of extremely high purity. When their sensations are successfully communicated to others, they experience great satisfaction and even greater drive to act. They value connection with emotions and meaning, and cannot move on 'just doing things' alone. Whether resonance occurs or not becomes the starting point for action over thought -- they are resonance-driven activators.",
    "decision_making_style": "This type's decision-making is heavily influenced by sensory and physical elements: 'who am I with,' 'what is the atmosphere like,' and 'what emotions arose.' Rather than rationally comparing information, they judge at the speed of sensation -- 'this might be good' or 'I want to ride this wave.' Because they are strongly influenced by situations and relationships, they can be very proactive in some contexts and passive in others, showing significant variability and sometimes lacking stability. However, when they follow their intuition, their action power and influence are overwhelming. Even when things haven't been verbalized internally, they have a structure that allows them to move when they feel 'now is the time,' with a judgment style that never misses 'a meaningful moment.'",
    "choice_pattern": "When faced with choices, this type operates on criteria like 'does it feel right,' 'does it seem interesting,' and 'did my heart move.' They value whether the emotional wavelength matches more than logic, and while they may struggle with complex comparison and deliberation, when they encounter something that feels like 'this is it,' they decide and act immediately. They tend to value 'chance' and 'flow' in their selections, and intentional planning takes a back seat to the atmosphere of the moment or someone's offhand remark influencing their choice. Rather than reflecting on their decisions, they believe in 'the vibe and momentum of the moment' and dive in, frequently assigning meaning after the fact.",
    "blindspot": "This type's challenge is that impulsivity takes precedence, leading to situations where they 'move before preparations are in order' or 'end up unable to sustain effort.' Additionally, because emotional resonance drives their actions, they react sensitively to changes in environment or relationships, which can amplify inconsistency. Acting without adequate verbalization can create gaps in intent and misunderstandings with others, leaving them anxious when asked 'why did you do that?' The important thing is not 'organizing before acting' but rather having a recovery structure for 'organizing after acting.' Developing the skill to communicate their resonance sensations to others leads to stability and trust.",
    "interpersonal_dynamics": "This type has good compatibility with **planning types who provide structure (e.g., S1-DG)** and **resonance types who translate their sensations (e.g., S2-PC)**, gaining 'sustainability' and 'meaning-making' that prevents things from ending with just momentum. Additionally, with **types who similarly move on intuition (e.g., S3-TC)**, they can easily ride spontaneous currents together, accelerating each other's actions as tempo-matched partners. However, they struggle to mesh with excessively cautious, calculating judgment types or conservative types who slow the pace, often accumulating stress from feeling misunderstood. Relationships that allow free leaps while moderately supplementing structure function best for this type.",
    "growth_path": "For this type to evolve, it is important to develop 'the habit of putting into words what they felt and acted upon.' Impulses and intuition are valuable starting points, but 'meaning-making' is essential for sharing them with others. Additionally, making it routine to 'reflect on the results of action' helps them understand their behavioral patterns and develop reproducible approaches. Furthermore, by partnering with 'someone who can resonate and move together,' structural growth that doesn't end with just momentum becomes possible. While using intuition as a starting point, developing 'the power to structuralize resonance' without being tossed by emotional waves is the key to this type's maturation."
  },
  "ACJG": {
    "name": "パルサー",
    "archetype": "Coordinator",
    "description": "This type is a 'switch-waiting' actor who continuously holds onto their inner intuitions and ideas, but whose trigger to act comes from external stimulation. The moment external expectations, timing, or encouragement from others arrives, the intuition they've been harboring is released all at once, leading to accelerated action. They are often seen as 'someone who can do it when they try,' and indeed, once they start moving, they demonstrate speed and breakthrough power that exceeds others' expectations. However, internally they always carry the sense that 'maybe I'm not ready yet,' and without a catalyst or flow, they have an instability that prevents them from getting started. The coexistence of these two extremes enables situation-responsive change and progress -- they are dynamic-response-type drivers.",
    "decision_making_style": "The primary trigger for decision-making is 'external pressure' or 'the arrival of the right timing.' While ideas and possibilities already exist within them, transforming these into conviction requires 'someone's encouragement' or 'a situation that demands it.' Rather than deciding through thorough deliberation, their will solidifies in response to external stimulation of 'I have no choice but to move now,' after which their judgment and action become extremely swift. Even without advance planning, they have the power to proceed without hesitation when they intuit 'there is meaning in this very moment,' and chance encounters or events can create major turning points. While their judgment may lack consistency, their precision and sense of conviction when responding to external pressure is unmatched.",
    "choice_pattern": "When facing options, they naturally observe 'which direction the current is flowing' and 'whether there are external factors that can move them.' Even though they have an internal sense of 'I want to try this,' that alone is usually not enough to decide. Movement only emerges when they feel 'the timing has come' or 'someone needs me.' As a result, they tend to be strongly influenced by others' eyes, atmosphere, and recent changes, with choices more often determined by 'external signals' than 'internal selection.' However, when that choice aligns with their inner intuition, the switch flips instantly, generating intense focus and expansive power. They may initially seem to be carried by the current, but midway through, they begin running on their own feet.",
    "blindspot": "The risk this type faces is that 'the trigger to act depends too heavily on others and the environment.' Though their inner landscape is rich with intuition and possibility, without the switch to bring it to the surface residing within themselves, they stagnate without external encouragement. When they feel 'the flow isn't here,' nothing feels manageable, and they may experience anxiety and helplessness. Furthermore, even after starting to move, if external expectations disappear, their motivation weakens and they may lack sustainability. The key is finding 'ways to flip their own switch.' By consciously designing environments and building relationships where even small external pressures or signals can get them moving, they can maintain consistent action.",
    "interpersonal_dynamics": "This type has good compatibility with **resonance types who support activation (e.g., S2-PC, S4-TC)** and **structure types who organize plans (e.g., S1-DG, S3-TC)**. Especially when there is someone who affirms their ideas and sensations and naturally prompts 'why not try it now?', their action switch is instantly activated. Additionally, teaming up with equally momentum-driven partners (e.g., S3-DG) further amplifies their explosive power when riding a wave. However, in relationships where their waiting posture is criticized or where decision-making speed is forced upon them, they easily lose confidence. The ideal partner is one who respects their pace and timing while gently pushing them forward.",
    "growth_path": "For this type to evolve, it is important to cultivate the sense of 'having an activation switch within themselves.' By developing the sensitivity to notice 'this may be a small current, but it's meaningful to me' even without external pressure, internal activation becomes possible. Additionally, by preparing in advance and verbalizing ideas, their response speed when external pressure arrives increases, and they stop missing 'rideable waves.' Furthermore, by not over-relying on 'others' expectations' and instead internalizing 'this was my own choice,' autonomy over taking action develops. When they learn to find 'resonance switches' between their environment and themselves, this type achieves stable yet bold transformation."
  },
  "ACRN": {
    "name": "レディエント",
    "archetype": "Source of Inspiration",
    "description": "This type possesses a 'sensibility-explosion' structure that converts inner emotions and impulses directly into action and expression without suppression. They find value not in externally imposed logic or goals, but in 'what wells up from within right now,' with a strong desire to communicate it to others or give it form. Because emotion is the starting point, there are ups and downs, but that very quality gives them the power to create 'living expression' and 'reality that exists only in that moment.' Sensation precedes thought, and they are characterized by a stance of pushing through with what they want to express, unconstrained by others' evaluations or frameworks. They are the type who easily becomes a presence that moves spaces with passionate energy and stirs people's hearts.",
    "decision_making_style": "This type's decision-making is triggered by emotional peaks and momentary inspiration. With frequent impulsive, instinctive judgments like 'I do it because I want to' and 'I move because I want to give form to this emotion now,' their process differs from conventional comparison and logical judgment. They judge based on an inexplicable but certain 'feeling,' which may appear erratic to others but is an internal necessity to them. Because it is connected to their desire for expression, the most critical factor is 'whether this choice allows me to externalize my feelings.' Since emotion and action are directly connected, their decision-making has waves, and maintaining a steady rhythm requires deliberate effort.",
    "choice_pattern": "Their selection criteria are 'does it ignite my emotions' and 'can I feel my authentic self in it,' with goal achievement and efficiency being secondary. They are intuitively drawn to new stimulation and strong empathy, tending to choose in a rush driven by uncontrollable inner impulse. Their style is 'choosing while thinking,' not logically pre-constructed selections but rather 'I just want to try it' and 'if I don't move now, this feeling will vanish' -- prioritizing the freshness of emotion. On the other hand, they struggle to calmly compare options, and sometimes wonder afterward 'why did I choose this?' Their defining characteristic is a strong sense that choosing equals expressing.",
    "blindspot": "The caution point for this type is that while the intensity of impulse and emotion fuels their action, their 'maintenance power when passion cools' tends to decline. Something started with passion may halt the moment resonance is lost, or become impossible to sustain. Additionally, by always prioritizing their 'current feelings,' timing and intent gaps with others easily arise, not infrequently generating misunderstanding or isolation. Furthermore, verbalization tends to lag behind, and in situations where they struggle to properly convey their intent, they are prone to carrying a sense of loneliness that 'no one understands me.' The key is to balance 'staying true to emotions' with 'creating structures that sustain expression.'",
    "interpersonal_dynamics": "This type has excellent compatibility with **resonance types who accept their expression (e.g., S2-PC and S4-TC)**, and being able to release their impulses and emotions without rejection allows them to move freely. Additionally, when paired with **planning types who supplement action sustainability (e.g., S1-DG)**, sustained use of energy becomes possible, producing 'expression that takes form' rather than mere impulse. With similarly impulsive types (e.g., S3-DG), synergistic effects occur, though emotional runaway and escalation can happen, making a calm support figure helpful for balance. What matters most is connecting with 'environments and people who can receive their heat.'",
    "growth_path": "For this type to evolve, they need to 'channel the heat of emotion into sustainable expression structures.' Impulse is a wonderful starting point, but sustaining it requires external mechanisms and support. When they develop the ability to design 'how to maintain a momentary blaze' and 'how to continue even when passion cools,' they can sustain expression without depending solely on emotion. Additionally, by sharing what they feel in words with others, relationships deepen from 'resonance to co-creation,' enabling more influential movement. It is not just the power to explode but 'the skill to keep the flame burning' that supports this type's maturation."
  },
  "ACCP": {
    "name": "フォーカス",
    "archetype": "Specialist",
    "description": "This type is a precision-thinking type that values 'certainty' and 'logical consistency.' Before starting anything, they tend to thoroughly analyze background information and structural causality, and they most dislike acting on assumptions. They are careful with words, skilled at abstraction and conceptual design, yet will not casually venture into things they haven't fully understood. While goal-oriented, they choose to 'move strategically' rather than acting hastily, leading others to perceive them as calm and composed. Though their emotional expression is restrained, a quiet drive for self-improvement is deeply rooted within, with high awareness of intellectual inquiry and improvement -- they are a type that builds depth into their own structure.",
    "decision_making_style": "In decision-making, they prioritize data, evidence, and reproducibility over 'feeling' or 'atmosphere.' When evaluating options, they build up objective indicators and logical validity rather than relying solely on subjectivity. Because they won't take a step unless they can explain 'why I chose this,' they may sometimes lack speed, but their conviction and precision after choosing are characteristically high. Moreover, they are not merely analytical -- they also value internal satisfaction such as 'does this mean something to me?' and 'will this lead to growth?' Thus, their decision-making is a strategic structural judgment style, designed with awareness of the balance between internal and external, reason and emotion.",
    "choice_pattern": "When facing options, they first perform 'comparative analysis,' understanding the structure and risks of each before choosing 'the one that makes the most logical sense.' When uncertain, they take the time to gather information, avoiding choosing while ambiguity remains, making intuitive snap decisions difficult. In return, once they've made a choice, they engage with it persistently, maintaining the flexibility to self-verify and course-correct even as circumstances change. They also frequently make the judgment that 'now is not the time to choose.' They are careful but never conservative -- rather, a fundamental structure of 'not making hasty choices to improve future precision' underlies their approach.",
    "blindspot": "This type's strength lies in 'high-quality judgment,' but when it backfires, they risk falling into 'perfectionism' or 'over-analysis.' Particularly when they feel 'judgment criteria aren't in order' or 'I can't obtain certainty,' they tend to freeze, potentially missing opportunities or creating pace gaps with those around them. Additionally, because they excel at explanation and organization, they tend to expect the same level of thinking and structural understanding from others, creating dialogue gaps when they 'can't understand why others don't understand.' The key is reclaiming the sense that 'it's okay to refine while moving, even if things aren't perfect,' which restores the balance between structural flexibility and action.",
    "interpersonal_dynamics": "The best compatibility is with **intuition-driven, expansion-oriented types (e.g., S3-DG)** -- 'practitioners who advance by trial and error.' Having someone who validates strategies and hypotheses through action creates the tangible sense of 'advancing using structure.' Conversely, there are significant process differences with sensory-impulse types and highly improvisational expression types, requiring dialogue adjustments. Additionally, they can have surprisingly good compatibility with **resonance types (e.g., S2-PC)**, potentially discovering that 'moving with others, even when things aren't perfectly organized, can reveal satisfying structures.' Pairing with someone who supplements the speed and emotional fluidity they lack makes their thinking even more multidimensional.",
    "growth_path": "The key to this type's evolution is accumulating the experience of 'moving while things are still imperfect.' Experiencing firsthand that new structures become visible by starting to move, even when everything isn't perfectly organized, enables a shift from 'the comfort of standing still' to 'the growth of rebuilding while moving.' Additionally, sharing their thinking with others prevents the state of 'isolating through over-structuring.' By opening their strengths of precision and analytical ability not as 'closed knowledge' but as 'intelligence rebuilt collaboratively with others,' the next phase unfolds. The keywords are 'conviction in the incomplete' and 'structural connection with others.'"
  },
  "JDPU": {
    "name": "マーキュリー",
    "archetype": "Embodiment of Intellect",
    "description": "This type is extremely sensitive to 'the atmosphere of the present moment' and 'subtle changes in sensation.' They grasp information and situations by first 'feeling' them, judging things based on an intuitive sense of 'fit' or 'misalignment' before putting anything into words. At first glance, they may appear illogical, but internally they have cultivated rich sensitivity and a unique structural understanding, with strong commitment to their own sense of coherence. In relationships with others, they place great importance on 'whether resonance is possible,' favoring someone's 'aura' or 'presence' over superficial information. While they give a soft impression, they are also a delicate type that is deeply hurt when their senses are denied or ignored.",
    "decision_making_style": "This type's decision-making revolves around internal resonance rather than logical comparison or analysis -- centered on 'which direction do I feel energy right now?' and 'is something resonating within me?' Because of this, verbalization may come later, and explaining 'why they chose something' to others can be difficult, yet internally they have a clear 'sense of satisfaction.' Though decisions appear sensory on the surface, they are underpinned by complex emotional and interpersonal awareness, and in social situations their intuitive sense of balance is often highly valued. Their style is one of flexibly shifting their axis to match the atmosphere and the other person's state, aligning their own senses with external circumstances.",
    "choice_pattern": "When faced with choices, what they first prioritize is the sensory response: 'which way does my heart move?' and 'which way does my body naturally lean?' They value the physical sense of 'absence of discomfort' more than comparing information, and won't reach for an option that 'doesn't click,' even if it makes logical sense. Conversely, they have the power to boldly step into something that sensorially feels like 'this is it,' even while sensing risk. However, because their selection criteria reside within their inner world, their intent can be hard for others to read, and they may sometimes be out of step with those around them. When others empathize with their senses, it transforms into great trust and action power -- a resonance-based selection style.",
    "blindspot": "When dependence on sensation becomes too strong, they can become trapped by feelings like 'I don't know why, but I don't like it,' unable to move. In situations requiring accountability, the inability to verbalize 'what was chosen by feel' becomes stressful and can lead to self-denial. Because they value resonance, they may over-accommodate others, causing their own axis to waver, or be swept along by the atmosphere into choices that aren't genuinely their own. What matters is the perspective of allowing both themselves and others to accept that 'sensation equals valid grounds,' and making a habit of 'structuring sensibility' -- retroactively providing explanations for intuitive choices. When they can connect sensation and logic, softness and depth merge beautifully.",
    "interpersonal_dynamics": "This type has good compatibility with **resonance-sensitive types (e.g., S2-PC and S3-TC)** -- with partners who similarly value sensation and atmosphere, deep understanding can emerge even with few words. Additionally, pairing with **logic types (e.g., S1-DG)** who provide grounds and structure for their senses serves as a 'verbalization assistant,' enabling them to act with confidence. However, stress tends to build with instant-decision types or those with strong emotional volatility, due to differences in tempo and values. Relationships with those who believe in their senses and can translate and receive them create the most stable and creative environment.",
    "growth_path": "The key to this type's growth lies in 'reproducibility of sensation' and 'structuring of intuition.' In other words, cultivating the habit of digging deeper into 'what I somehow thought or chose' -- exploring the physical, emotional, and social context behind it -- enables transformation. Additionally, when their senses misfire, rather than denying it as 'failure,' receiving it as 'an opportunity to improve precision' cultivates more flexible and confident intuition. Furthermore, having people and spaces where they can safely put their feelings into words is crucial. The experience of feeling that 'my senses were useful to someone' through resonance pushes this type's action and structure to the next level."
  },
  "JDCA": {
    "name": "メディテーション",
    "archetype": "Philosopher",
    "description": "This type is an introspective type who, while not outwardly showing it, constantly asks themselves 'what is the right answer?' and 'how can I avoid making mistakes?' Their action energy is often driven by 'things they want to avoid' -- avoidance-based motivations such as 'I don't want to fail' or 'I don't want to cause trouble for others.' However, behind this lies a sincere orientation of 'wanting to be better' and 'wanting to grow,' and they often quietly accumulate effort and preparation where others can't see. Though perceived as cautious and reserved, they possess strong observational and adjustment abilities internally, performing at their highest in quiet settings. They want to refine before revealing, to reduce uncertainty before advancing -- a delicate and earnest growth-oriented type.",
    "decision_making_style": "Decision-making begins from 'how to minimize risks that should be avoided.' Rather than actively choosing, they carefully predict 'what problems would arise if I didn't choose this,' gradually solidifying their will. Though others may perceive them as 'looking indecisive,' extremely nuanced deliberation is actually taking place internally, with the time spent being used for 'safety confirmation.' Their own sense of satisfaction is critically important -- they struggle to act because someone told them to, maintaining a style of 'being unable to move until I feel within myself that this will be okay.' Judgment is ultimately keyed to internal consistency, with 'inner conviction' serving as the activation switch.",
    "choice_pattern": "This type's choices are structured to prioritize 'not failing.' When multiple options exist, they first identify the risks and problems lurking in each, tending to decide based on 'whichever seems to cause the least damage.' They prioritize 'whether I'll regret not doing it' over 'whether I want to do it' -- appearing passive but actually making highly structural judgments. Meanwhile, they tend to distance themselves from emotionally or momentum-driven options, and their selection speed may not match instant-decision types. However, once chosen, they proceed with deep focus and stability, demonstrating particularly strong sustainability when 'values worth protecting' are clear.",
    "blindspot": "What requires the most attention is 'opportunity loss from inaction.' By trying to avoid every risk, their judgment may be deferred too long, causing them to miss chances or become isolated from waves of change. Additionally, when the state of 'things aren't ready yet' or 'I'm anxious' prevents them from taking a step for too long, it can lead to decreased self-esteem and a sense of stagnation. Being sensitive to others' evaluations and expectations, they exhaust easily in environments where they can't maintain their own pace, requiring conscious effort to 'design their own safety zone.' Rather than perfect preparation, shifting awareness to 'moving on what I can do now, even if partially' becomes the key to breaking through structural stagnation.",
    "interpersonal_dynamics": "This type has good compatibility with **stable, logic-oriented types (e.g., S1-DG and S4-TC)**, performing best in relationships that provide an environment where they won't be rushed and can proceed at their own pace. Additionally, pairing with **action-driving types (e.g., S3-DG)** provides catalysts for taking real first steps, making it easier for thinking to connect to practice. However, friction tends to arise with intuition-first types or emotionally explosive types, potentially leading them to unnecessarily lose confidence, thinking 'maybe I'm wrong.' Relationships with those who watch over them without denial make coexistence of security and progress possible.",
    "growth_path": "For this type to structurally evolve, it is important to shift the focus of judgment from 'what I want to avoid' to 'what I want to aspire to.' The structure they have protected through avoidance now needs to be reassembled as 'offensive design' -- this becomes the starting point for growth. To achieve this, they need to accumulate 'small success experiences' and let the body remember the feeling that 'it was okay to move.' Additionally, by verbalizing their inner world and sharing it with others, they can acquire the sensation of 'moving forward while being empathized with,' triggering a structural conversion from avoidance to agency. The keyword is 'not just protecting, but giving form to what you desire.'"
  },
  "JDRA": {
    "name": "クリスタル",
    "archetype": "Person of Insight",
    "description": "This type is a reality-oriented type that most values 'not failing' and 'producing stable results.' Without being swayed by emotions or trends, they prefer to make careful judgments based on proven frameworks and data. While their spirit for challenge is modest, their strength lies in 'stable, highly reproducible action,' possessing the tenacity to steadily accumulate diligent effort. They are easily trusted by those around them and have the ability to calmly handle unpredictable situations, yet they always carry a strong structural desire to be 'in a state of readiness,' with some resistance to change and uncertainty. They cherish their own methods and rules, finding security in 'protecting' rather than 'disrupting.'",
    "decision_making_style": "This type prioritizes 'stability' and 'reliability' in decision-making. Rather than novelty or excitement, they often follow 'methods that are already working' or 'precedents of past success,' excelling at choices rooted in logic and data. They place high trust in 'track records,' 'numbers,' and 'systems,' with emotional or intuitive judgment becoming secondary. They tend to proceed cautiously in decision-making, focused on 'not making mistakes' and 'not incurring losses,' valuing precision over speed. When they have certain evidence, they can proceed with confidence, but in unknown territory or when evidence is insufficient, their movement tends to stall.",
    "choice_pattern": "When options exist, this type first evaluates 'the probability of failure,' prioritizing the choice where that probability is lowest. Rather than 'is it new?' or 'do I want to do it?', the focus falls on 'is it safe?' and 'is the success rate high?' -- tending toward reliable moves rather than bold challenges. They are cautious about change, and choosing to defer by not selecting is also commonly observed. Their thought process during selection is logical, placing weight on structural consistency, but if their internal 'rules to protect' become too rigid, flexible selection can become difficult. Because they don't move until they feel a firm sense of confidence, their sustainability and reliability after choosing are extremely high.",
    "blindspot": "This type's strength is 'stable judgment and execution power,' but when it overextends, it directly leads to the risk of 'falling behind on change' and 'losing flexibility.' Because anxiety about the unknown is strong, they tend to react negatively to innovative proposals or challenges without immediately visible results, and in situations of major environmental change, their adaptation tends to lag. Additionally, by clinging to familiar methods, they may reject others' flexible approaches, creating friction within organizations and teams. What's important is not just 'avoiding failure' but having the perspective of 'managing change.' The key to evolution lies in a flexible strategy of 'designing change proactively' after estimating risks in advance.",
    "interpersonal_dynamics": "This type has excellent compatibility with **flexible, planning-oriented expansion types (e.g., S2-DG)** and **future-oriented resonance types (e.g., S4-TC)**. By partnering with someone who broadens their perspective without breaking their stability structure, a safe evolution of 'changing without changing' becomes possible. Conversely, friction tends to arise with impulsive intuition-action types and improvisational expression types, with potential pace gaps of 'we don't need to rush that much...' A relationship where the partner understands the structure they want to protect and can gently co-design gradual change brings out this type's maximum potential.",
    "growth_path": "For this type to structurally evolve, they need the perspective of reconciling 'protecting stability' and 'not rejecting change.' When they can redefine that change does not equal chaos -- that 'managing change actually creates greater stability' -- their range of action expands dramatically. 'Starting with small changes' is effective for this. For example, trying a tool they've never used before, or doing work in a different order -- incorporating 'tolerable fluctuations' into daily life cultivates a flexible self-structure. Additionally, by accumulating the experience that 'even after failure, recovery is possible,' a structural conversion occurs where they realize that 'protecting' is not their only value."
  },
  "JDCP": {
    "name": "コスモス",
    "archetype": "Strategist",
    "description": "This type is a 'responsive logician' who, while being thought-heavy and logic-structure oriented, is activated by 'others' questions' or 'resonance from the environment' as starting points. Rather than thinking in isolation, when they feel 'someone needs this' or 'this is necessary for this situation,' the structures sleeping in their mind spring to life all at once. Internally they possess high analytical and explanatory abilities, with the power to organize things calmly without being swayed by emotions, but when and where they deploy these abilities tends to be governed by 'resonance conditions.' They are a type whose intelligence truly blooms when the expectations of the environment and individual thought are connected -- performing at their best when 'others serve as a catalyst.'",
    "decision_making_style": "The key to this type's decision-making is the process of logic construction born from resonance. Their thinking is deep, with adherence to information accuracy and structural consistency, but they have some resistance to 'deciding on their own arbitrarily,' and decisions become clearer when there is 'someone's question,' 'a social theme,' or 'a discussion context.' Thus, 'responsive decision-making' is characteristic -- 'how do I interpret this problem?' and 'what should I return to this situation?' Being a deliberation type, their speed is slower, but when satisfactory reasoning comes together, their judgments have consistency and persuasive power. The defining trait is that 'my answer only takes shape when someone's question exists.'",
    "choice_pattern": "In making choices, they prioritize 'whether it is logically consistent for me' and 'how this choice connects to someone's expectations or themes.' Rather than simply searching for the correct answer, they choose from the perspective of 'what kind of structural response can I demonstrate in this situation right now?' When comparing options, they carefully examine information volume, evidence, and contextual fit. Meanwhile, choices that only they find satisfying feel like 'closed thinking,' and they may hesitate, unable to find meaning. Since their motivation for choosing is 'responding to someone's question,' social significance and mutual understanding are important factors in their selections. It is a resonance-driven selection style.",
    "blindspot": "This type's risk is that 'thinking stagnates in the absence of resonance.' Without someone's expectations or questions, despite being logical, they can fall into a structure where they cannot initiate action, sometimes losing confidence in their own judgment. Additionally, by being too attached to logic, they may undervalue emotions and intuition, making judgments that are out of sync with the surrounding temperature. Furthermore, if they prioritize only 'explainable choices,' they may lose sight of their inner sensations and desires, becoming mechanical. What matters is 'asking themselves before responding to others.' By cultivating 'self-resonance,' decision-making that doesn't depend on others becomes possible.",
    "interpersonal_dynamics": "This type has excellent compatibility with **resonance types who pose deep questions (e.g., S2-PC, S4-TC)** and **practical types who bridge to action (e.g., S3-DG)**. Especially when they encounter someone who simply asks 'what does that mean?', their logic rapidly becomes verbalized and structured, and their judgment axis becomes clear. Additionally, pairing with **sensibility types (e.g., S4-PC)** helps them notice emotional aspects they might overlook through logic alone, balancing their judgment. However, in environments that constantly demand instant decisions or say 'just act without explaining,' their strengths go unused and excessive stress results. The connection to 'environments where their thinking is questioned' is the most important compatibility factor.",
    "growth_path": "For this type to grow, it is important to develop the power to shift from 'answering others' questions' to 'posing questions within themselves.' The ability to move through dialogue and theme-setting with others is already in place, but by developing the daily habit of asking 'why is this important to me?' and 'what does this bring me?', autonomous thinking and action become possible without waiting for resonance. Additionally, by incorporating emotions, discomfort, and other non-logical elements as judgment material, the quality of resonance deepens further, and structural depth increases. Self-dialogue and the structuring of questions guide this type's inner evolution."
  },
  "JDCV": {
    "name": "マトリックス",
    "archetype": "Architect of Knowledge",
    "description": "This type tends to give a calm impression, with little inclination toward large spontaneous action. However, when a certain kind of 'external pressure' arrives -- deadlines, expectations, others' reactions -- they suddenly exhibit high concentration and action power. While they internally possess the will of 'I want to do what needs to be done' and 'I want to meet expectations,' this doesn't always surface, with the switch only activating 'when necessity demands it.' As a result, they tend to be perceived as a 'quiet person' in daily life, yet their thinking and preparation actually proceed beneath the surface, making them a 'latent executor' who can produce a surge of output when needed. The key lies in how they design the timing of action and their own pace.",
    "decision_making_style": "This type's decision-making is largely triggered by 'external factors.' Rather than deciding through solitary deliberation, their actions become clear through 'being asked by someone' or 'the situation becoming urgent' -- they possess a structure activated by external pressure. This is not indecisiveness, but rather a characteristic of 'being unable to generate the pressure to decide on their own.' When pressure actually arrives, they demonstrate high concentration and judgment, capable of making essential decisions in short timeframes. Thus, rather than wavering at their own pace, deliberately designing 'pressure' through means like 'setting deadlines' or 'making commitments with colleagues' helps them achieve both quality and speed in their decisions.",
    "choice_pattern": "When options exist, this type tends to defer with the judgment that 'I don't need to move yet,' but springs into action when external pressure or timing arrives. They place more significance on 'when to choose' and 'in whose presence to choose' than on the judgment itself, and while generating motivation internally is difficult, relationships with others and deadlines become 'sparks' that activate selection. Their judgment under pressure is remarkably accurate, representing moments where everyday preparation and observation come alive. However, there are also cases where they cannot clearly articulate 'why I chose this,' and others may perceive them as 'passive.' In reality, they simply hold 'time to organize without choosing,' and their final decisions carry genuine conviction.",
    "blindspot": "While the structure of being able to move through external pressure is powerful, without it they risk remaining in long-term deferral. Preparation and ideas may accumulate while the timing for execution is missed. Additionally, if they prioritize others' expectations over their own judgment, they become prone to the regret of 'I actually wanted to do it differently.' Furthermore, when pressure becomes excessive, 'pushback' occurs and they may apply their own brakes, requiring adjustment of the appropriate 'amount and quality of pressure' for themselves. By clarifying 'for whom am I moving?' and 'which pressure enables healthy activation?', and deliberately designing their switches, the reproducibility of their performance increases.",
    "interpersonal_dynamics": "This type has good compatibility with **thinking types who organize structure (e.g., S1-DG)** and **sensibility types who support motivation through resonance (e.g., S2-PC)**, finding it easier to move when someone can verbalize and organize their inner world. Additionally, pairing with **action-execution types (e.g., S3-DG)** creates a practical partnership where both can prompt each other to start moving. Conversely, instant-decision types and emotionally impulsive types don't match their tempo, and self-denial about being unable to move may intensify. Rather than adjusting to the partner, 'choosing environments and people who draw out their own movement' allows them to perform most naturally.",
    "growth_path": "The key to this type's evolution is enhancing the ability to 'design pressure for themselves.' By learning to create 'mechanisms for initiating action' through schedules, goals, and commitments with colleagues without depending on external pressure, stability in both the timing and quality of action emerges. Additionally, when they can transform the perception that 'pressure is bad' into 'pressure is the structural condition that draws out my potential,' their self-regulation ability grows dramatically. Without rushing, without being fully organized, by accumulating the experience that 'moving now creates a wave,' they evolve from a being swayed by pressure into a self-designer who leverages pressure."
  },
  "CHRA": {
    "name": "ヴィーナス",
    "archetype": "Idealist",
    "description": "This type is a perception-oriented type that is extremely sensitive to subtle changes in surrounding atmosphere and emotions, naturally sensing 'what is being called for right now' rather than 'how should I move.' They rarely put their own will or desires front and center, moving carefully while respecting others' feelings and atmosphere. They place high value on not disrupting harmony and relationships, often receiving the favorable impression of being 'a pleasant person' in social situations. However, behind this, delicate monitoring is always at work -- 'how am I being perceived?' and 'is the current relationship intact?' -- and they have a side that is deeply swayed by others' distance and reactions. They are a very soft, structure-sensitive resonance type who values empathic connection.",
    "decision_making_style": "This type's decision-making activates within waves of external expectations and emotions. They often can't get started thinking alone, and the action switch only turns on when external pressure is added -- 'for someone's sake' or 'because I was asked to.' However, this is not mere passivity; it is also a carefully calculated response considering 'how can I make the other person feel at ease' and 'how can I be accepted.' Sensation plays a strong role in decision-making, with 'does it feel right' and 'does it match the current atmosphere' serving as important criteria. Because they judge by 'degree of resonance' rather than logic, there is clear consistency within themselves, though it may be difficult to convey to others.",
    "choice_pattern": "When given options, this type tends to first think 'which choice will keep relationships with others smooth.' Their criteria lean toward 'how will others perceive this?' and 'will I hurt anyone?' rather than 'I want to do this,' making them somewhat cautious about selection itself. Their selection axis shifts with situations and people, so flexibility rather than consistency characterizes their style, and they frequently prioritize others over themselves. Sensory 'clicking' feelings also support their choices, but when emotions are unstable, they may keep wavering without being able to decide. They regard choosing as an act of connecting with someone -- a resonance-prerequisite selection tendency.",
    "blindspot": "This type's risk is 'easily losing sight of their own will.' By caring too much about relationships, they suppress their own emotions and wishes, and the accumulation can lead to sudden emotional explosions or self-loss. Though things appear unproblematic on the surface because they accommodate others, internally they often make choices they don't agree with, carrying strong regret later. Furthermore, because opportunities to verbalize what they truly want are scarce, conscious will-formation becomes difficult. What matters is distinguishing between 'resonance' and 'conformity,' and cultivating the habit of carefully picking up their own sensations and judgments.",
    "interpersonal_dynamics": "This type has good compatibility with **introspection-prompting thinking types (e.g., S3-TC)** and **verbally organizing structural types (e.g., S1-TC)**, with many cases where having someone put their emotions and senses into words clarifies their judgment. Additionally, with **similarly resonance-oriented types (e.g., S2-TC)**, they can connect deeply on a sensory level, building relationships of wordless comfort. However, they tend to have their pace disrupted by strongly assertive types or instant-decision types, potentially feeling 'there's no place for me.' Relationships that receive their sensitivity and help put it into words together support both stability and change for this type.",
    "growth_path": "For this type to grow, it is important to balance 'resonating with others' and 'resonating with oneself.' Precisely because their resonance ability is high, the small outputs of 'trying to put that sensation into words,' 'trying to organize it,' and 'trying to share it with someone trustworthy' accumulate into clearer self-structure. Additionally, by building experiences where 'my choice also benefits someone,' resonance and self-actualization stop being separate, and confidence and will develop. The process of realizing that 'it's okay to value my own senses too,' not just 'for others' sake,' enables structural leaps. The key to this type's evolution is elevating resonance into a foundation for self-establishment."
  },
  "CHJA": {
    "name": "ディアナ",
    "archetype": "Artist",
    "description": "This type is an 'adaptive logic type' who responds very flexibly to environmental changes and situational differences while maintaining their own judgment axis to pursue growth. Using not just intuition and sensation but also real-time perception of information and structural changes, they constantly update 'what is the best action for me right now?' as they move forward. They have excellent situational judgment and observation of reality, unbothered by the process of making incremental adjustments. However, they don't simply go with the flow -- they also possess the composure to not move without 'a reason that satisfies me.' While appearing flexible on the surface, inside them is rooted the will to 'advance little by little' and 'become better' -- they are practical growth-seekers who transform both environment and self simultaneously.",
    "decision_making_style": "This type's decision-making has a structure close to a judgment algorithm of 'choosing the best option from current information.' Without being swayed by ideals or sensation, they collect and compare necessary data, then judge very realistically -- 'should I move now?' and 'what choice carries the least risk?' Additionally, 'whether there is a reason that satisfies me' is important, with a tendency to avoid deciding ambiguously. Their judgment has speed while also being adjustable according to the flow of events, which characteristically prevents stagnation or fixation. It's a structure of gradually fine-tuning judgment axes within changing environments while continually updating 'meaningful choices.'",
    "choice_pattern": "This type holds the flexible stance of 'choosing with change as a premise.' When several options exist, they compare them against current conditions and select 'what has the highest feasibility and is least likely to fail.' Additionally, 'how easy it will be to adjust after choosing' often becomes a judgment criterion over 'choosing definitively,' and they consider future risks and development possibilities in their evaluation. Because they apply necessary modifications even to things already decided, they may be seen as 'indecisive,' but in reality it is the rational style of 'reselecting while moving.' Because they can make decisions premised on change, they can proceed flexibly without excessive tension.",
    "blindspot": "While this type combines flexibility and logic, when they 'rely too heavily on information,' they may deprioritize their true feelings and intuition, creating a disconnect of 'I have reasons to choose, but my heart isn't in it.' Additionally, adapting too much to change can blur 'where does my own will end?' and 'who am I accommodating?', potentially resulting in lost direction. Furthermore, when revision and reconsideration become too habitual, 'not deciding definitively' can become its own comfort zone, making it difficult to feel a sense of growth. What matters is verbalizing 'what do I want to value while remaining flexible?' and anchoring a personal 'selection axis' at their core.",
    "interpersonal_dynamics": "This type has good compatibility with **vision types who set direction (e.g., S4-DG)** and **introspective types who deeply verbalize things (e.g., S2-PC)**. Having someone who organizes the fluctuating options from the perspectives of language, logic, and structure fosters confidence and clarity. Additionally, pairing with **high-activation action types (e.g., S3-DC)** creates a tempo of decision and execution, increasing action volume. However, gaps tend to emerge with strong emotional expression types or conservative types who reject change, and when their flexibility is denied, stagnation follows. Relationships where both can positively embrace change together support this type's evolution.",
    "growth_path": "For this type to evolve, it is important to 'bring their own will into the midst of change.' While they excel at adjusting to situations and others, relying solely on this makes it difficult for their own axis to develop, potentially creating the sense that 'I've just been drifting along.' The key is to verbalize 'what do I want to value in choosing?' and 'what meaning do I want to give this change?' Additionally, developing retroactive judgment from a long-term perspective enables more strategic selection. What matters is holding a self-designing perspective of 'optimizing not just for now, but including the future.' When the 'core of will' is added to flexibility, growth accelerates exponentially."
  },
  "CHAT": {
    "name": "ユーレカ",
    "archetype": "Innovator",
    "description": "This type is highly sensitive to environment and people's atmosphere, a flexible type who values 'situation-appropriate responses' over fixed values. Their intuition works readily, possessing a sensor-like sensitivity that instantly detects the 'right-feeling' direction for the situation at hand. They tend to move carefully so as not to disrupt interpersonal dynamics or the atmosphere of a space, with an excellent perspective for seeing 'whether things feel comfortable overall' and 'whether everyone is connected without strain.' Meanwhile, because self-assertion isn't strong, they harbor intelligence and consideration that often goes unnoticed, naturally stepping into roles as 'mediator' or 'connector' between people. Rather than a fixed self, they flexibly form 'the current self' while resonating with context and others -- a supple, relationship-focused type.",
    "decision_making_style": "This type's decision-making is supported by the power to simultaneously read 'the overall flow' and 'inner sensation.' Not through calculation or logic, but by reading the structure of atmosphere and emotions -- 'which direction would be more natural to move right now?' and 'what does everyone think?' -- they search for the optimal choice for the situation. Therefore, unlike planned, methodical decision-making, their will tends to flexibly change as situations shift. Some may perceive this as 'indecisive,' but they actually possess very nuanced judgment criteria, with a structure that considers not only 'what do I want to do' but also 'how will this choice resonate with others and relationships.'",
    "choice_pattern": "This type tends to intuitively choose 'whichever feels right in this moment' rather than comparing options. Gathering too much information can cause confusion, with the sensation that 'all of them could work' or 'they all seem right.' Therefore, having a certain degree of 'flow' or 'atmospheric sense' helps their selection sense become clearer. Selection criteria more often center on 'whether I can maintain human relationships and emotional waves without disruption' rather than 'whether it's structurally correct,' and they naturally take responses like 'finding a middle ground' or 'deferring' to avoid forced choices. While the 'basis' for their choices is hard to share, it carries reliability grounded in sensory consistency.",
    "blindspot": "What this type needs to be most careful about is 'losing sight of their true feelings.' By valuing harmony with others too much, 'what I actually want' can become invisible, or they may prioritize others' emotions to the point of self-sacrifice. Additionally, while they excel at responding to changing situations, they tend to feel resistance toward 'defining their own axis,' and in long-term decision-making or positions of responsibility, stress accumulates easily. What's important is not just riding the flow but maintaining the perspective of questioning 'do I actually want this flow?' By leveraging their high resonance as a strength while also listening to their own will, structurally stable decision-making becomes possible.",
    "interpersonal_dynamics": "This type has excellent compatibility with **structural-perspective logic types (e.g., S1-PC)** and **introspective types who carefully verbalize their senses (e.g., S2-PC)**. The partner's clarity serves as support for organizing their own ambiguity, building a comfortable collaborative relationship. Additionally, with **highly resonant intuitive types (e.g., S3-TC)**, they connect through a sense of 'understanding without words,' mutually providing a sense of safety. However, stress tends to build with pushy decision types or controlling types, risking loss of self. Within relationships where their flexibility is respected, their natural selection power and capacity for change are fully expressed.",
    "growth_path": "For this type to grow structurally, it is important to develop 'the power to translate will, not just rely on sensation.' By carefully putting into words why their choices feel the way they do, 'reproducibility' and 'structure' are added to sensation, enabling choices that others can also understand. Additionally, deliberately accumulating experiences of acting based on 'convictions that exist only within themselves' helps them discover selection axes beyond 'harmony with others.' Furthermore, self-awareness that discerns between 'being carried by the flow' versus 'riding the flow' becomes the key to maintaining structural agency without being swept away by change. The essential maturation of this type lies in the coexistence of flexibility and a firm axis."
  },
  "CHJG": {
    "name": "アテナ",
    "archetype": "Guardian",
    "description": "This type is an actor with flexibility and responsiveness who is set in motion by 'being needed by someone' or 'responding to circumstances.' Rather than initiating major change themselves, they naturally respond to the flow and requests around them, finding their own meaning within that process. With high adaptability, they blend well in interpersonal relationships and groups, valued as 'someone who can read the room and act.' On the other hand, they rarely put their own will front and center, prioritizing flowing naturally with things, so 'what am I expected to do?' tends to take precedence over 'what do I want to do?' However, they steadily build their abilities by meeting others' expectations -- an 'evolving through relationships' type.",
    "decision_making_style": "This type's decision-making activates when 'expectations from someone' or 'clear roles' are assigned. Rather than agonizing or deliberating alone for extended periods, they operate smoothly when there is an external call such as 'please do this' or 'I'm counting on you.' Their judgment criteria weigh 'whether the judgment preserves relationships' and 'whether it disrupts the atmosphere' more than personal gain or loss. Additionally, they often realize their growth after the fact -- 'I tried it and found I could actually do it' -- and rather than choosing with strong initial will, their decision-making style is one where 'things get decided as they move.'",
    "choice_pattern": "In selection situations, a strong tendency toward 'naturally going along with the expected direction' is apparent. Without strong personal preferences, when both options have rationality, they sensitively respond to 'what is someone wanting right now?' They tend to choose to avoid friction with those around them, prioritizing 'harmony of the space.' Additionally, they find it easy to move when clear options are given, but tend to feel bewildered when told 'you're free to choose.' Conversely, they have the flexibility to skillfully work within given options to produce results, excelling at adding their own ingenuity within instructions. Though appearing receptive, it is a dynamic selection style that involves reselecting through dialogue with the environment.",
    "blindspot": "This type's risk is that 'by responding too much to others and environment, their own axis doesn't develop.' While this may work initially, long-term it can lead to no longer knowing 'what do I actually want?' Additionally, by trying to meet expectations, they may take on roles beyond their capacity, gradually becoming depleted without realizing it. Furthermore, by matching the atmosphere too closely, they risk being unable to say 'no' and being swept along. What's important is confirming whether 'myself acting for someone's benefit' is 'also meaningful to me.' While cherishing relationships, carefully verbalizing 'what do I want?' becomes the starting point for growth.",
    "interpersonal_dynamics": "This type has excellent compatibility with **leader types who provide stable structure and perspective (e.g., S4-PG)** and **coordination types who co-design flexible environments (e.g., S2-DG)**. As long as the partner doesn't impose their structure, complementary relationships emerge naturally, building mutually growth-oriented connections. Additionally, pairing with **highly resonant types (e.g., S2-PC)** enables sharing unspoken sensations and emotions, allowing them to move with a sense of safety. However, they tend to feel stress with strongly self-assertive leading types or instant-decision types due to pace mismatch. Relationships where they aren't dragged along by the partner's pace and their own way of choosing is respected function most naturally.",
    "growth_path": "For this type to evolve, it is important to 'rechoose assigned roles for themselves.' The ability to find personal satisfaction and meaning within tasks and situations given by others is already present, but rather than just 'accepting,' asking 'how do I want to leverage this?' initiates structural growth. Additionally, by practicing verbalizing not just 'for someone's sake' but 'how this action has value for me,' their internal axis develops, enabling more autonomous movement. When they can 'choose authentically while accommodating others,' maintaining their adaptive flexibility, this type changes most powerfully, deeply, and supple."
  },
  "CHJC": {
    "name": "オプティマス",
    "archetype": "Master of Choice",
    "description": "This type is extremely sensitive to changes in emotion and physical sensation, possessing a 'leap-type' characteristic where they suddenly shift into action when external environmental discomfort or stress exceeds a certain threshold. While they normally tend to be quiet and adjust to those around them, at a certain moment when internal limits or feelings of suppression build up, they break the prevailing atmosphere to strongly express their own feelings or suddenly choose major change. Though their actions may appear abrupt to others, for them it is based on a clear internal necessity -- 'I can't stay here any longer' or 'now is the time to break free.' Emotional fluctuation and eruption form a unified structure -- they are change-sensitive, dynamic reactors.",
    "decision_making_style": "This type's decision-making is switched on by 'how uncomfortable the current state is.' Rather than goals or plans, they more often move from internal tension of 'if things stay like this, I'll break' or 'I want to be freer.' What may look like 'escape' or 'avoidance' contains strong will and a desire for structural transformation. Decisions are often intuitive and speedy, with 'whether I can be satisfied' taking the highest priority over others' evaluations. They don't fear change and have little hesitation about changing their environment themselves, but they tend to struggle with stable long-term judgment. Because they move in strong reaction to situations, 'a sense of structural limits' is inherent in the background of their decision-making.",
    "choice_pattern": "Their selection criterion is 'how much discomfort exists in the current situation.' When stress in the current state builds up, they tip sharply toward new options to resolve it. The timing of choosing may appear impulsive, but it is actually the result of discomfort that has gradually accumulated internally reaching its peak, which means the 'sense of satisfaction after choosing' is very high. On the other hand, they have little interest in collecting sufficient information for comparison, with 'whether I feel it in this very moment' being the most important judgment criterion. The number of options matters less than 'whether I can escape' and 'whether there's somewhere to leap to,' and they tend to feel stress from remaining unchosen.",
    "blindspot": "The risk this type tends to face is that 'emotional leaps keep recurring without being structuralized.' While the courage to not fear change and leap in is a great strength, if the structure remains unstable after landing, they tend to face similar problems again. Additionally, because they often act before communication with others catches up, they are easily misunderstood with 'why so suddenly?' Furthermore, if 'escaping from the current place' becomes a constant premise, stable relationships and long-term perspectives become difficult to develop. What matters is having a process of verbalizing and sharing their discomfort while it is still small, before reaching the point of emotional explosion.",
    "interpersonal_dynamics": "This type has good compatibility with **stable logic-structure types (e.g., S1-DG)** and **empathic types who resonate with and accompany their senses (e.g., S4-TC)**. Having someone who doesn't deny their emotional ups and downs and leaps, but rather helps untangle 'why they moved that way,' makes post-leap actions more sustainable. Additionally, with **flexible types who accept structural change (e.g., S2-DG)**, they can build relationships where change is designed and navigated together. However, they tend to clash with highly disciplined management types or types who suppress emotional expression, which can lead to self-repression. 'Environmental design that doesn't presuppose explosions' generates good compatibility.",
    "growth_path": "For this type to grow, the most critical point is 'moving before the explosion.' In other words, learning to convert discomfort and stress into small actions and words before they reach their limit brings structural evolution. Additionally, having the perspective of 'not just creating change, but designing what comes after change' transforms leaps from one-time events into sustained transformation. Furthermore, through the experience of 'designing change together with someone,' a new style of progressing self-transformation without isolation develops. The keywords are 'verbalization before explosion' and 'structural construction after change.'"
  },
  "RSAW": {
    "name": "ルナ",
    "archetype": "Healer",
    "description": "This type simultaneously possesses 'flexibility to match the situation' and 'caution based on their own standards of satisfaction' -- a very delicate yet solid resonance type. They have the sensory ability to read the room, quickly catching others' presence and subtle discomfort, while trying to organize that information not as 'subjective impression' but as 'structure.' They observe situations not just from 'how do I feel' but from a meta-perspective -- 'how does this state work as a whole?' and 'where are the misalignments?' Meanwhile, because they value stability and trust, they are cautious about bold change or impulsive action, with a strong consciousness of 'wanting to move after things are settled.' They are a quietly centered coordinator type -- softness with a core.",
    "decision_making_style": "This type's decision-making is built on 'sensation plus consistency.' Even when their senses tell them 'it somehow feels like this,' they take the process of checking that against structures and data. The characteristic stance is 'I trust my senses, but I also want evidence,' which means decisions tend to take some time. To prevent judgment from wavering, 'prerequisite conditions I want to protect' and an 'organized environment' are necessary, and when these are in place, they can hold very stable convictions. Additionally, there are situations where they delay their own judgment by being too conscious of harmony with others, but the key judgment axis is 'whether self and others are protected as a structure.'",
    "choice_pattern": "In making choices, they tend to choose 'whichever is reliably reassuring' and 'whichever won't cause strain,' looking at 'which is more organized' rather than 'which is better.' When options contain many uncertain elements, they may become unable to move, and the technique of 'waiting without choosing' -- deferral -- is also characteristic of this type. Even when their senses tell them 'this seems good,' they won't immediately trust it and leap in; they have the caution of wanting to verify and confirm first. Only when both sensation and structure are satisfying does their selection proceed, and from there, their actions remain unwavering and consistent. They view selection as an act of protecting the safety of themselves and others -- a stability-resonance type.",
    "blindspot": "This type's risk is 'becoming unable to act due to excessive pursuit of consistency.' They can't decide on sensation alone, yet they become anxious when structure and evidence aren't complete, and 'time just passes without moving' occurs frequently. Additionally, by caring too much about others' opinions and atmosphere, they may suppress their own senses, which accumulates as fatigue and discomfort over time. Furthermore, if they seek perfection too much, they risk staying 'perpetually in preparation.' What matters is creating 'a design that allows movement even with some imperfection' and 'trying things on a small scale' to develop the balance between sensation and structure in real situations.",
    "interpersonal_dynamics": "This type has good compatibility with **planning types who support action design (e.g., S1-DG, S3-TC)** and **sensibility types who carefully build resonance-based relationships (e.g., S2-PC, S4-TC)**. When someone empathizes with their 'bridging of sensation and structure' and provides words and pacing, judgment and action become very smooth. However, they tend to feel overwhelmed by forceful decision types or fast-paced instant-decision types, shrinking at the feeling of 'having no time to think.' With 'relationships where they can organize and advance together,' this type's strengths of 'overall harmony' and 'steady progress' are maximally expressed.",
    "growth_path": "For this type to evolve, the key is shifting not just from 'moving after organizing' but also to 'organizing while moving.' By attempting to 'take one step forward with available materials' even in situations without perfect information or structure, flexibility in both judgment and action develops. Additionally, not just trusting their own senses but 'sharing those senses with others in words' enhances structural consistency and reliability. Furthermore, when they can hold the awareness of 'connecting their judgment to someone's peace of mind,' their selection and action evolve from merely 'protecting' to 'supporting.' Reframing their caution not as a limitation but as 'design power that supports the whole' opens the door to maturation."
  },
  "RSCV": {
    "name": "ミューズ",
    "archetype": "Inspirator",
    "description": "This type possesses strong resonance that seeks to connect with others at an emotional depth, excelling at carefully putting their experiences and sensations into words. Rather than mere information exchange, they find value in 'having feelings understood mutually' and 'delivering thoughts to each other,' weaving 'shared narratives' through dialogue and expression. Sensitive to others' pain and joy, they don't overlook 'unspoken emotions' or 'subtle tremors,' naturally earning trust as a counselor and understanding presence. On the other hand, because their own emotions run deep, they tend to carry wounds for a long time, and they are particularly sensitive to distortions in relationships. Through words that touch 'the depths of the heart,' they create essential connections -- an empathic storyteller type.",
    "decision_making_style": "This type's decision-making builds from emotional resonance as its starting point. 'Which choice can I genuinely be satisfied with from the heart?' and 'what kind of relationship can I build with whom?' become judgment axes, with 'depth of meaning' and 'narrative consistency' valued over rationality. They tend to use experiences that moved their heart or events that strongly stirred emotions as judgment benchmarks, not deciding based solely on superficial benefits or numbers. Conversely, they often won't reach for options that 'somehow feel off' or 'don't quite click,' even when they can't explain why. Because emotional movement and self-narrative consistency are crucial, decisions may take time, but once satisfied, they make remarkably firm decisions.",
    "choice_pattern": "When faced with options, this type chooses from the perspectives of emotion and meaning -- 'which fits my feelings?' and 'which choice can deepen a relationship with someone?' Characteristically, they judge intuitively yet introspectively, imagining 'how will I change by choosing this?' and 'what story will it become?' The focus falls more on 'the quality of relationship the choice brings' and 'alignment with self-image' than on the choice itself, tending to select 'what feels meaningful' over 'what I want to do.' Not because someone expected it, but because they most value whether 'the choice is one I can genuinely resonate with' -- an emotional-satisfaction selection structure.",
    "blindspot": "This type's risk is that by strongly depending on emotion and resonance, they 'can't choose when emotions waver' and 'can't move until satisfied' -- falling into such structures. Additionally, by handling their own feelings too carefully, they may overlook realistic constraints and efficiency. Furthermore, because they deeply resonate with others' emotions too, they risk taking on others' feelings excessively, causing their own judgment axis to waver. What matters is the perspective that 'resonance is a necessary condition but not a sufficient one,' and understanding that 'current emotions change, and it's okay to move on that premise.' By accompanying emotions while maintaining room for action design and change, the balance between flexibility and strength is achieved.",
    "interpersonal_dynamics": "This type has high compatibility with **logic types who complement through words and structure (e.g., S1-PC)** and **intuitive types who are equally sensitive to emotion and resonance (e.g., S3-TC)**. With someone who doesn't try to forcibly change their emotions and simply accepts them, they can safely nurture their own will. Additionally, with **adaptive types who have a gentle flow (e.g., S2-TC)**, paces naturally align, facilitating selection accompanied by empathy and introspection. However, values tend to clash with instant-decision types or types who prioritize 'results over emotions,' and there is a danger of self-expression being suppressed. Partners who listen carefully to their narrative and help find meaning together support this type's judgment and action.",
    "growth_path": "For this type to evolve, the key is 'bridging the time lag between emotion and action.' When they lean too much into accompanying emotions, they tend to skew toward a structure of 'being unable to move until satisfied,' but by accumulating the experience of 'organizing while moving' even with incomplete emotions, the distance between action and meaning shrinks, expanding the range of self-expression. Additionally, holding the perspective of not just 'resonating' but 'designing resonance' enables them to build proactive positions in dialogue and creation. When they realize that stories are not just to be read but also to be written by themselves, this type's inner world rapidly transforms into the power to cultivate connections with others."
  },
  "RSAB": {
    "name": "ボンド",
    "archetype": "Unifier",
    "description": "This type is a passionate action type who uses emotions boiling within them as fuel, carving through situations with impulsive movement driven by 'I can't help but do this.' Direct and honest with what they feel, uncontainable passion can suddenly erupt into action, carrying strong influence that sweeps others along. They start moving naturally not from logic or gain/loss calculations, but from internal motivations like 'I want to be honest with how I feel right now' and 'I want to do what I can for someone.' Beyond simply empathizing quietly, the 'impulse of emotions that can't stay still' forms their axis, giving their actions an unshakeable 'heart conviction.' They naturally stand at turning points of movements and atmospheric shifts -- an emotion-driven propeller.",
    "decision_making_style": "This type's decision-making is based on how much 'sense of conviction' or 'urgency' exists in the emotions welling up inside, rather than comparing external information. Triggers like 'not choosing this would feel like betraying myself' and 'I feel there's meaning in me doing this' -- internal emotional axes -- directly become judgment triggers. They struggle to engage with things that don't move their emotions, but once their switch flips, they have the speed to initiate action even by skipping detailed analysis. While the decision-making process is intuitive and emotional, it is never haphazard -- they also have an introspective side that digs deep into 'why did I feel this way?' -- a conviction-based judgment structure underpinned by personal meaning.",
    "choice_pattern": "This type's selection tendency depends heavily on 'whether I can trust this feeling right now.' More important than precise information comparison or logical consistency is 'whether this choice ignites my heart' and 'whether there is enough urgency to move me.' Timing of selection is often abrupt, matching the peak of emotion, with the 'emotional wave' of the moment strongly directing the choice. On the other hand, when emotion subsides, passion can cool just as rapidly, so some mechanism or support is needed for sustained selection. Because feelings often move while choosing, selection progresses as a dynamic process.",
    "blindspot": "The risk this type tends to face is a pattern where they start acting purely on emotional momentum but lack composure and can't sustain it, or later look back with doubt and regret. While they can exert overwhelming power at peak emotional intensity, how to maintain and stabilize that energy is a major challenge. Additionally, with high empathy and strong emotional projection onto others, the boundary between self and other can become blurred, making it difficult to distinguish 'what I truly want to do' from 'what I'm being moved to do for someone.' Having space before and after action to absorb emotional waves, and maintaining the awareness to 'organize meaning while moving,' allows them to convert passion into driving force without loss.",
    "interpersonal_dynamics": "This type has good compatibility with **thinking types who verbalize and structure emotions and impulses (e.g., S1-PC)** and **empathic types who receive emotional waves through resonance (e.g., S2-PC)**, making it easier to transform their impulses from transient episodes into meaningful action. Additionally, with **execution types who work alongside them in the field (e.g., S3-DG)**, a powerful combination of momentum and realization capability can be expected. However, they tend to struggle to match tempo with overly calm cautious types or rationalist types who dismiss emotions, easily feeling self-suppression or frustration. Relationships that value passion while co-creating with composure deepen this type's actions.",
    "growth_path": "For this type to grow, 'the design power to convert emotional explosiveness into sustainable energy' is needed. Beyond just moving on impulse, the introspective time of 'why was I moved by this emotion?' and 'how can I make this emotion into a sustainable form?' evolves their actions. Additionally, by experiencing the process of sharing feelings with others and connecting resonance to co-creation, 'emotions belonging only to oneself' can be transformed into 'emotions nurtured together with someone.' What matters is maintaining emotional purity while being conscious of connection with the external world. 'Converting momentary heat into sustainable power' is the key to this type's maturation."
  },
  "RSBL": {
    "name": "ハーモニー",
    "archetype": "Mediator",
    "description": "This type is an introspective resonance type who deeply feels the subtle movements of inner emotions and nuances of relationships with others, carefully observing and analyzing them. Rather than expressing emotions outwardly, they first take them inside themselves, then engage in a thought process of questioning 'what is happening?' and 'what meaning does this hold?' They have a strong stance of trying to understand situations and others' positions from multiple angles, accepting that 'things can be seen in many ways' without rushing to conclusions. While they give a calm and quiet impression, their interior is a coexistence of complex emotions and thought, excelling at 'putting the unspoken into words.' They combine deep resonance with multifaceted insight -- a quiet dialogue type.",
    "decision_making_style": "This type's decision-making is built not through snap judgments but through time-intensive deliberation and introspection. Moving between multiple perspectives -- their own feelings, others' intentions, situational background -- they search for 'what is the most satisfying choice right now?' They are not easily moved by external pressure, and because they won't act until every option is in a state they 'can explain in their own words,' others may perceive them as cautious and observational. However, the flow of emotion greatly influences this process, and rather than whether something is logically correct, what matters is 'how does my heart find satisfaction?' and 'what kind of relationship will be nurtured?' They start moving as if the fog has cleared when depth of resonance and internal consistency overlap.",
    "choice_pattern": "When selecting, they carefully examine multiple layers one by one: 'my emotions,' 'the other person's feelings,' and 'the meaning this selection brings.' Rather than emotional impulse, factors like whether they'll regret it long-term and whether there will be negative effects on relationships are important -- they tend to value internal and social harmony. Additionally, they have a desire to 'give meaning to the act of choosing itself,' with strong resistance to 'choosing casually.' Because of this, they may agonize alone while others decide quickly, but their action power and sincerity after finally choosing carry depth. They value 'how to engage' more than 'what was chosen' -- their selection structure centers on engagement.",
    "blindspot": "This type's risk is 'overthinking to the point of paralysis' and 'getting caught up in emotions and losing sight of their judgment axis.' While their empathy is high and they can naturally receive others' perspectives, over-processing internally can blur what they truly wanted. Additionally, because they have a structure that can't lie to their own feelings, they are unable to 'act without being satisfied,' potentially missing opportunities. What's important is 'trying to move within some degree of uncertainty' and 'trusting resonance even when incomplete.' When they avoid over-scrutinizing emotions and develop a rhythm of choosing 'the best I can do right now,' judgment that combines depth and lightness becomes possible.",
    "interpersonal_dynamics": "This type has good compatibility with **resonance types who carefully listen to their emotions and thoughts (e.g., S2-PC)** and **execution types who provide catalysts for action (e.g., S3-DG)**. Having someone nearby who respects their introspective pace while lightly prompting the next step narrows the gap between judgment and action. Additionally, pairing with **logic types (e.g., S1-TC)** provides assistance in structurally organizing the sensations they hold vaguely. However, with types that prioritize speed above all or relationships where their emotions are dismissed, stress increases and judgment dulls. Relationships that receive and respect their depth are what draw out this type's power.",
    "growth_path": "For this type to evolve, the key is experiencing 'provisional execution' -- moving without waiting for complete satisfaction. Precisely because they can carefully handle both thought and emotion, starting 'the process of giving it form' first generates new discoveries and satisfaction. Additionally, by always having 'words that their current self can be satisfied with,' they can engage with unprocessed emotions with peace of mind. Furthermore, developing 'the power to put uncertainty into words' through dialogue with others prevents them from bearing their inner world in solitude, connecting to co-creative judgment. When quiet depth connects to dynamic selection, the richest growth arrives."
  },
  "AWJG": {
    "name": "サーチライト",
    "archetype": "Person of Insight",
    "description": "This type usually appears reserved with calm emotional waves, but the moment someone's expectations or emotional call reaches them, 'the deep force of emotion' springs into action -- an external-pressure resonance type. Normally, they tend to prioritize 'others' emotions' and 'relational harmony' over their own feelings, often becoming a lubricant that soothes those around them. However, when a certain 'responsibility' or 'necessity' is added, those emotions transform into a sense of mission and devotion, generating substantial action power. They perform at their best when they can feel 'I can be useful to someone' or 'I want to protect this relationship' -- a stable-resonance emotional practitioner. Though they rarely show it outwardly, warm and strong convictions quietly burn deep within their hearts.",
    "decision_making_style": "Decision-making has a structure where not only 'their own emotions' but 'someone's emotions' and 'relational context' serve as activation conditions. When relied upon by someone, or when they feel they are needed in a situation, their will surges all at once, and they can move without hesitation on things they had been wavering about. Conversely, on the basis of their own will and judgment axis alone, they find it hard to move, with 'external emotional signals' such as 'does doing this feel meaningful?' and 'does someone want this?' serving as auxiliary lines for judgment. Therefore, in situations where relationships with others are thin, decision-making tends to lag. However, by using 'emotional resonance' as judgment material, they possess the power to make extremely satisfying decisions.",
    "choice_pattern": "When facing options, this type searches for 'emotional connection points' -- 'can I align with my own feelings?' and 'does it connect with someone's wishes?' Additionally, in situations where they bear responsibility or feel expected of, internal pressure of 'I must choose' kicks in, enabling swift and sure judgment. On the other hand, by overthinking how their choices will affect others, emotions like 'I don't want to hurt anyone' and 'I don't want to fail' may take precedence, making it impossible to choose. Whether emotional connection exists becomes the key to prompting selection, and they tend to prioritize 'choices that protect connections' over self-driven choices.",
    "blindspot": "This type's risk lies in the tendency to 'prioritize others' emotions over their own too much.' Behind the wonderful strength of being able to act for someone is the danger that 'what I was actually feeling' gets left behind. Additionally, when emotional responsibility is too strong, they may take on others' emotions excessively, pushing themselves to act beyond their capacity. Furthermore, if they depend on the structure of 'I can only move when needed,' the environment may gain too much control. They need the perspective of treating their own emotions as 'part of the relationships worth respecting,' carefully balancing others' expectations with their own will.",
    "interpersonal_dynamics": "This type has excellent compatibility with **empathic types who handle relationships carefully (e.g., S2-PC, S4-TC)** and **logic types who support emotions with stable structure (e.g., S1-DS, S2-DS)**. Having someone who verbally organizes their emotions and actions makes it easier for 'emotional satisfaction' and 'structural meaning-making' to overlap. Additionally, pairing with **action types who provide execution support (e.g., S3-DG)** achieves balance between emotion and action without carrying too much weight. However, with types who dismiss emotions or who move with instant decisions, pace and value gaps tend to arise, and forcing alignment can trigger self-exhaustion. 'Relationships where emotions are handled with care' elevate the quality of this type's selection and action.",
    "growth_path": "For this type to grow, the shift in awareness from 'responding only to others' to 'also responding to my own emotions' is necessary. While possessing the power to be moved by connections and expectations with others, by asking 'was that choice honest to my own feelings?' and 'how was I really feeling?', emotional balance and behavioral autonomy develop. Additionally, when they can grant themselves permission that 'it's okay to move even before being needed,' their emotions undergo a structural change from passive to active, enabling freer and more stable self-expression. Directing the kindness and sense of responsibility in their emotions toward themselves as well supports this type's essential growth."
  },
  "AWAB": {
    "name": "パノラマ",
    "archetype": "Observer from Above",
    "description": "This type possesses an emotional-release creative structure that seeks to immediately externalize inner emotions and impulses as 'some form of expression' to confirm their own existence. Things felt, things that hurt, joy, discomfort -- none can be contained; they try to confirm their existence through expression and action. Their means of expression are diverse -- words, attitudes, physical expression, creation -- all based on the pure desire of 'I want to externalize this emotion right now.' While they have an emotional and reactive side, they also possess driving force that strongly pursues their ideal of 'how I want to be,' with a self-expanding characteristic that updates the self through emotion. Rather than empathy, 'putting themselves out there' comes first -- a self-liberation-oriented, emotion-led type.",
    "decision_making_style": "This type's decision-making occurs in nearly real-time, centered on 'how do I feel right now.' Rather than calmly thinking later and reconciling consistency, they are triggered by strong self-fidelity such as 'if I ignore this emotion, I won't be myself anymore,' tending to choose and move instantly. Especially when there is an internal 'catch' or 'discomfort,' they can't leave it alone, possessing a structure that externalizes reaction through decision-making. Additionally, the 'discomfort of not having chosen' weighs more heavily than responsibility for what was chosen, resulting in characteristically little hesitation in selection. However, acting reactively without deep thought can create situations requiring later organization and adjustment.",
    "choice_pattern": "When facing options, this type selects 'whatever makes me feel most alive,' 'whatever most naturally channels my current emotional state.' They struggle with suppressing emotions or compromising -- rather than restraining themselves for the sake of environment or others, they might choose not to choose at all. The primary axis of judgment is not whether the choice is correct, but 'am I not lying to myself?' and 'does this choice contain my authentic self?' Intuitive and improvisational selections are frequent, with 'what feels right in this very moment' taking priority over careful deliberation. They cannot choose when emotions are calm; rather, selection progresses precisely when emotions are heightened -- a structure where choices are strongly dependent on emotional waves.",
    "blindspot": "This type's greatest risk is that by concentrating on 'expressing their emotions,' friction and misunderstandings with others easily arise. While they have a strong drive for self-expression, moving immediately to action and speech in a heightened emotional state means they sometimes collide with others in an unprocessed state. Additionally, when self-expansion becomes too self-serving, gaps between 'not getting through to anyone' or 'lukewarm responses' and reality can wound them, risking extreme self-denial. By maintaining the purity of expression while adding just a little perspective on 'how to convey' and 'how I want to be received,' the precision of connection between emotions and others improves, achieving coexistence of self-liberation and empathy formation.",
    "interpersonal_dynamics": "This type has good compatibility with **sensibility types who resonate and receive (e.g., S2-PC, S4-TC)** and **structural types who translate emotions into language (e.g., S1-TC)**, finding stability in relationships where their expression is 'received' without being perceived as imposing. Additionally, pairing with **execution support types (e.g., S3-DG)** gives momentum to the process of transforming emotion from idea into reality. However, friction tends to arise with partners who are insensitive to emotional waves or types who constantly demand composure, creating a sense of blockage from 'not getting through' and 'not being able to be myself.' Relationships where someone receives their emotional flow and sometimes provides support enhance the sustainability of their self-expression.",
    "growth_path": "For this type to evolve, they need the power to 'build a bridge between expressing emotions and making them endure.' After a momentary expression ends, how they make meaning of that emotion and share it with others and the world -- when this awareness develops, explosive expression transforms into 'sustainable self-expansion.' Additionally, adding the perspective of not just releasing feelings but considering 'how I want them to be received' and 'in what context I want to deliver them' dramatically elevates the quality of expression. Self-liberation is not the goal but the starting point. When they can connect that passion to 'relationships' and 'structure,' this type transforms into a rare practitioner who bridges emotion and reality."
  },
  "AWRN": {
    "name": "レーダー",
    "archetype": "Sensor",
    "description": "This type does not hold a fixed answer to the question 'who am I?', but rather lives 'undefinedness' itself as their essence. They change their roles and attitudes according to situations, environments, and relationships, freely switching between 'multiple faces' while continuously transforming themselves. They neither fully assimilate into any structure nor reject it, excelling at 'straddling' multiple values and perspectives -- this fluidity itself becomes their fundamental identity. While they frequently feel 'hard to understand,' they possess flexible adaptability that can set foot in any world, with excellent sensitivity to the unknown and editorial thinking. They know that the self is not 'form' but 'motion' -- a contemporary boundary-crossing intelligence.",
    "decision_making_style": "This type's decision-making is not based on a single standard or logic but fluctuates according to 'what kind of self do I want to be right now?' and 'which context do I want to place myself in?' At times intuitive, at times logical, at other times resonance-focused -- while their decision-making style appears inconsistent, within themselves everything is accepted as 'the truth of this very moment.' They tend to seek 'a sense of fit' and 'connection with the environment' in choices rather than correctness, with sharp perception of where they should flow. They may struggle to explain 'why they chose that way' when asked, but they are always choosing as an act of will toward 'the next version of themselves.'",
    "choice_pattern": "This type's selection tendency is accompanied by a meta-perspective of 'which self among multiple selves should I adopt?' Rather than 'which is correct?', they hold multi-layered questions like 'which self fits this context right now?' and 'which possible self does this choice nurture?' while making selections, which can appear as inability to decide or as wavering. However, their flexibility toward selection is high, holding the premise that 'it's okay to change even after choosing,' which generates both freedom and psychological safety in selection. They view selection not as a final decision but as a 'waypoint' in self-renewal, with emphasis placed on 'how to nurture the self that chose.'",
    "blindspot": "The risk this type faces is that 'by constantly changing, the outline of the self tends to become vague.' Because they can accept any structure, they may be unable to put down deep roots anywhere, entering phases where 'who am I, really?' becomes invisible. Additionally, others may find them 'elusive,' and trust-building may take time. Rather than denying their 'boundary-crossing nature,' it is important to consciously recognize 'having multiple selves' as a quality and polish the words to communicate this to others. When they can recognize that 'it's not consistency but the richness of selectable possibilities that defines me,' their structure matures into one where flexibility and reliability coexist.",
    "interpersonal_dynamics": "This type has excellent compatibility with **accepting types who watch over their changes without fear (e.g., S4-TC, S2-TC)** and **logic types who verbalize and structure their judgments (e.g., S1-TC, S3-DG)**. Especially when engaging with someone who positively receives their 'undefined state,' their boundary-crossing nature begins to be recognized not as confusion but as 'charm' and 'possibility.' Additionally, engaging with people who hold multiple value systems deepens both the breadth of options and self-resolution. However, mutual understanding becomes difficult with those who strongly demand 'consistency' or 'fixed roles,' making them prone to having their fluidity denied. More than understanding, it is resonance; more than resonance, it is connection. Such relationships support this type's movement.",
    "growth_path": "For this type to structurally mature, the key is cultivating 'the power to convert the trajectory of selection into their own narrative.' Since the self is constantly changing, there is no need to make past and present consistent, but by verbalizing 'why have I changed this way?' and 'what meaning do I find in that change?' and sharing it with others, a 'flowing axis' is born within their structure. Furthermore, by building the trust that 'I may reselect, but each time I become a deeper version of myself,' they acquire a 'structure of evolution' rather than mere whimsy. When they can recognize that continuing to change is not 'wavering' but 'the power of self-reorganization,' this type becomes an existence that crosses others' boundaries while connecting worlds."
  },
  "AWJC": {
    "name": "オムニ",
    "archetype": "Information Master",
    "description": "This type is not clearly categorized into a specific activation axis or judgment style, possessing a 'mixed-type' structure where different structures naturally arise according to situations and relationships. They find it difficult to verbalize what kind of person they are, holding the sensation that their self changes depending on 'the situation of the moment,' 'the person they're engaging with,' and 'the role being asked of them.' This isn't intentional -- they have a fluidity where their 'existence shifts unconsciously to match the atmosphere,' and as a result, they often carry a long-standing sense of 'having difficulty defining themselves.' Somewhat elusive yet possessing the power to perceive essential things, they frequently function as an existence that mirrors those around them -- a quiet resonator.",
    "decision_making_style": "This type's decision-making is not driven by clear criteria or consistent logic, but is strongly influenced by unconscious sensation, atmospheric feel, and physical reactions. Even when they think they decided with their head, they often struggle afterward to explain 'why they chose that,' with awareness of the decision sometimes remaining vague. Conversely, their intuitive judgment -- 'I can't explain it logically, but this was the only way' -- can also be remarkably accurate. While they can retroactively put the intent of their actions into words, the judgment itself is formed through 'resonance with the situation and flow,' making the predictability and consistency of their decision-making limited.",
    "choice_pattern": "This type tends to find themselves having arrived at a certain choice without being clearly conscious of 'choosing.' Rather than selecting, the nuance is closer to 'drifting there' -- with even the person themselves feeling that the situation holds more initiative than their will. Thus, their selection pattern is not 'which do I want to choose?' but 'which am I naturally drawn to?' and 'somehow, it was decided before I noticed.' Meanwhile, there is a curious accuracy to these unconscious judgments, often resulting in choices that are 'just right' for them. Because they don't choose by logic, they also face moments of struggling with 'verbalizing the reason for the choice.'",
    "blindspot": "This type's risk lies in 'losing the awareness that they chose for themselves.' Because their judgment and selection process is unconscious, things are fine when they go well, but when they encounter failure or regret, they are prone to the anxiety of 'I don't understand why this happened' and 'did I really want this?' Additionally, because their intent is hard for others to see, misunderstandings of 'we don't know what they're really thinking' arise easily, creating communication gaps. What matters is 'retroactively giving meaning to unconscious choices' and having the habit of 'verbalizing and accumulating their own patterns.' While taking ambiguity as a given, layering 'gentle structure' upon it is important.",
    "interpersonal_dynamics": "This type can build complementary relationships with **stable types who have clear activation structures (e.g., S1-DG, S2-TC)**, and by encountering the 'will' and 'design axes' they themselves lack, the awareness of their judgments increases. Additionally, with **sensory types who carefully handle resonance (e.g., S4-TC)**, they can share sensations that can't be put into words, building comfortable relationships. However, with instant-decision types or strongly self-assertive types, pace and value gaps tend to arise, generating bewilderment of 'I don't know where to align.' The most stable relationships come from those who respect their fluidity while gently helping them form an axis.",
    "growth_path": "For this type to evolve, the key is 'consciously assigning meaning to unconscious judgments.' While maintaining the freedom that they don't necessarily need to hold a clear judgment axis, by reflecting on and verbalizing 'when do I tend to move this way, and how?' -- this becomes the foothold for self-understanding and change. Additionally, by reframing 'choosing is not defining' but rather 'creating flow after choosing,' they can act without fearing ambiguity. Furthermore, they can transform their 'ambiguousness' into a strength, becoming an existence that receives the blank spaces of others' structures. The absence of boundaries is not weakness but 'structural margin that can respond to change' -- this is how maturation proceeds."
  }
}
